In [1]:
import matplotlib.pyplot as plt
import matplotlib as mpl
mpl.rc('font',family='Malgun Gothic')
import seaborn as sns
import pandas as pd
import scipy.stats as stats

In [19]:
df_titanic = pd.read_csv('../../datasets/TitanicFromDisaster_train.csv')
df_titanic[:2]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [20]:
df_titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

### X 범주형 , Y 범주형 : 주로 독립성 증명 FEAT. chi2_contingency

선정변수 : 'Pclass','Survived'

    - 분석 내용 : 선실 등급에 따라 생존 여부가 달라지는가?
        - 귀무가설 : 선실 등급에 따라 생존 여부가 달라지지 않는다.
        - 대립가설 : 선실 등급에 따라 생존 여부가 달라진다.
    
    - 분석 결론 :(기준:p-value 0.05) / P.value < 0.05
                statistic=102.88898875696056, pvalue=4.549251711298793e-23
        - 통계 결론 : 대립가설 참 
        - 사실 결론 : 선실 등급에 따라 생존 여부가 달라진다.

In [22]:
df_titanic[['Pclass','Survived']].value_counts()

Pclass  Survived
3       0           372
1       1           136
3       1           119
2       0            97
        1            87
1       0            80
dtype: int64

In [24]:
df_titanic_data = df_titanic[['Pclass','Survived']].astype(str)

In [25]:
df_titanic_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    891 non-null    object
 1   Survived  891 non-null    object
dtypes: object(2)
memory usage: 14.1+ KB

In [26]:
df_titanic_data.describe()

       Pclass Survived
count     891      891
unique      3        2
top         3        0
freq      491      549

In [29]:
df_titanic_data.isnull().sum()

Pclass      0
Survived    0
dtype: int64

In [35]:
df_titanic_data_pivot = pd.pivot_table(data=df_titanic_data, index='Pclass', columns='Survived', aggfunc=len)
df_titanic_data_pivot # 피봇 테이블을 만든 이유는 계산된 데이터 프레임을 넣으면 안됨 집약함수를 만들었음

Survived    0    1
Pclass
1          80  136
2          97   87
3         372  119

In [33]:
stats.chi2_contingency(observed=df_titanic_data_pivot. correction=True) ##data는 집계된 data로, correction는 자유도

Chi2ContingencyResult(statistic=102.88898875696056, pvalue=4.549251711298793e-23, dof=2, expected_freq=array([[133.09090909,  82.90909091],
       [113.37373737,  70.62626263],
       [302.53535354, 188.46464646]]))

### X:연속형 / Y:연속형 : 주로 상관관계 확인

#### correlation coefficient(상관계수)
- -1 ~ 1
- 0에 가까우면 관계없음, -1로 갈수록 반비례, 1로 갈수로 정비례

In [37]:
df_titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### 선정 변수: age, Fare FEAT. stats.pearsonr

- 분석 내용 : 나이에 따라서 비용 변화가 있는가?
    - 귀무가설 : 나이에 따라서 요금 변화가 없다.
    - 대립가설 : 나이에 따라서 요금 변화가 있다.
- 분석결론 (기준:p-value 0.05) / P.value < 0.05 : 대립 참
    - 통계 결론 : 대립가설 참, 상관계수 비례관계
    - 사실 결론 : 나이에 따라서 요금이 올라간다.statistic=0.096, p-value=0.01)

In [38]:
df_titanic[['Age','Fare']].describe()

              Age        Fare
count  714.000000  891.000000
mean    29.699118   32.204208
std     14.526497   49.693429
min      0.420000    0.000000
25%     20.125000    7.910400
50%     28.000000   14.454200
75%     38.000000   31.000000
max     80.000000  512.329200

In [39]:
df_age_Fare = df_titanic[['Age','Fare']]
df_age_Fare[:2]

    Age     Fare
0  22.0   7.2500
1  38.0  71.2833

In [40]:
df_age_Fare.isnull().sum()

Age     177
Fare      0
dtype: int64

In [41]:
df_age_Fare = df_age_Fare.dropna().copy()

In [42]:
df_age_Fare.isnull().sum()

Age     0
Fare    0
dtype: int64

In [43]:
df_age_Fare.corr()

           Age      Fare
Age   1.000000  0.096067
Fare  0.096067  1.000000

In [44]:
stats.pearsonr(df_age_Fare['Age'],df_age_Fare['Fare'] )

PearsonRResult(statistic=0.0960666917690389, pvalue=0.010216277504446952)